var result = "============= 订餐明细 =============\n";
	
	for(var i = 0; i < iden.length;i++){
		result += name[i] + " x " + count[i] + " = " +(pri[i] * count[i]) + "元\n";
	}
	
	if(total_second  < total_first){ /*方案二*/
		result += "-----------------------------------\n使用优惠:\n" + "指定菜品半价(黄焖鸡，凉皮)，省"
				+ youhui+"元\n" + "-----------------------------------\n总计："+
				total_second+"元\n===================================\n";
	}
	else if(total_second  > total_first){/*一*/
		result += "-----------------------------------\n使用优惠:\n" + "满30减6元，省"
				+ 6 +"元\n" + "-----------------------------------\n总计："+
				total_first+"元\n===================================\n";
	}
	else{
		result += "-----------------------------------\n总计："+
				total_first+"元\n===================================\n";
	}
	
return result;
